{
  "HeroSection": {
    "greeting": "Hi, I'm Luis Marcelo!",
    "alt": "Profile photo of Luis Marcelo",
    "subtitle": "Full Stack Developer",
    "description": "Turning ideas into innovative digital solutions"
  },
  "AboutSection": {
    "title": "About Me",
    "paragraph1": "Student of Systems Analysis and Development, I am a technology enthusiast with a deep passion for programming and IT infrastructure. My journey in the tech field is driven by constant curiosity and the desire to transform ideas into digital solutions that make a difference.",
    "paragraph2": "Currently, I work as a Full Stack Development intern at CGE/RO (Controladoria Geral do Estado de Rondônia), where I am part of the Núcleo de Inovação e Prevenção à Corrupção. In this strategic position, I have the opportunity to apply technical knowledge to projects that promote transparency and modernization of the public sector, contributing directly to more efficient and ethical management."
  },
  "SkillsSection": {
    "title": "Technologies"
  },
  "ExperienceSection": {
    "title": "Experience",
    "professional": "Professional",
    "academic": "Academic",
    "items": {
      "prof-1": {
        "title": "Full Stack Development Intern",
        "company": "CGE/RO - Controladoria Geral do Estado de Rondônia",
        "period": "Apr 2025 - Present",
        "description": "Development of scalable web applications, technical team leadership, and implementation of modern architectures."
      },
      "prof-2": {
        "title": "IT Intern",
        "company": "CGE/RO - Controladoria Geral do Estado de Rondônia",
        "period": "Oct 2024 - Apr 2025",
        "description": "I worked in IT support and infrastructure, performing computer maintenance, network administration, and technical support for the organization's servers."
      },
      "acad-1": {
        "title": "Systems Analysis and Development",
        "company": "IFRO (Instituto Federal de Educação, Ciência e Tecnologia de Rondônia)",
        "period": "Feb 2023 - Present",
        "description": "Currently enrolled in the 5th of 6 semesters, I was part of the campus development team, Calama Devs."
      },
      "acad-2": {
        "title": "Technical Degree in Informatics",
        "company": "IFAM (Instituto Federal de Educação, Ciência e Tecnologia de Rondônia)",
        "period": "Jan 2018 - Dec 2020",
        "description": "Participated in research projects and development of web and mobile systems using modern technologies."
      }
    }
  },
  "ProjectsSection": {
    "title": "Projects",
    "items": {
      "coneci-ro": {
        "title": "CONECI - RO (In development)",
        "description": "Developing the official landing page for CONECI-RO, the State Internal Control Council, with a voting system to elect the new event leadership."
      },
      "estudante-auditor": {
        "title": "Estudante Auditor (In development)",
        "description": "Developing the official landing page for the Student Auditor Project, an initiative by the State Comptroller General of Rondônia (CGE/RO) in partnership with SEDUC/RO."
      },
      "wiki-cge": {
        "title": "Wiki.CGE (In development)",
        "description": "Contributing to the development of Wiki.CGE, an informational platform aimed at transparency, internal documentation, and dissemination of institutional knowledge at the State Comptroller General of Rondônia."
      },
      "gerenciador-de-horarios": {
        "title": "Schedule Manager",
        "description": "System for managing IFRO class schedules. I was responsible for backend development, with a special focus on importing spreadsheets using the PhpSpreadsheet library."
      },
      "chaewon-yugioh": {
        "title": "3D Card Chaewon Yugioh",
        "description": "Created an animated 3D card of Chaewon in Yu-Gi-Oh! style"
      },
      "catedog": {
        "title": "Cat&Dog",
        "description": "Web system for a pet shop with user and pet registration, service requests (bathing, grooming), e-commerce with free delivery, and a complete admin panel."
      },
      "pokedex": {
        "title": "Pokedex",
        "description": "Created to practice API consumption. It's an interactive Pokédex that uses the PokéAPI to fetch real-time information about different Pokémon, such as name, image, type, and number."
      },
      "receitas-do-mestre": {
        "title": "Master's Recipes",
        "description": "A recipe blog, developed as part of the Web Programming Fundamentals course, aimed at demonstrating knowledge in HTML."
      },
      "spacetime-sga": {
        "title": "Spacetime - Shai Gilgeous Alexander",
        "description": "An interactive time capsule to showcase memories along a timeline, creating a visual and responsive experience."
      }
    }
  },
  "ContactSection": {
    "title": "Contact",
    "getInTouch": "Get in Touch",
    "description": "I am always open to new opportunities and collaborations. Get in touch with me!",
    "email": "Email",
    "location": "Location",
    "followMe": "Follow Me",
    "sendMessage": "Send Message",
    "form": {
      "name": "Name",
      "namePlaceholder": "Your full name",
      "email": "Email",
      "emailPlaceholder": "your.email@example.com",
      "subject": "Subject",
      "subjectPlaceholder": "What would you like to talk about?",
      "message": "Message",
      "messagePlaceholder": "Write your message here...",
      "submit": "Send Message",
      "sending": "Sending...",
      "success": "Sent successfully!",
      "tryAgain": "Try again",
      "successMessage": "Message sent successfully! I will reply soon.",
      "errorDefault": "Error sending message",
      "errorUnknown": "Unknown error"
    }
  }
}