{
  "HeroSection": {
    "greeting": "Oi, eu sou Luis Marcelo!",
    "alt": "Foto de perfil de Luis Marcelo",
    "subtitle": "Desenvolvedor Full Stack",
    "description": "Transformando ideias em soluções digitais inovadoras"
  },
  "AboutSection": {
    "title": "Sobre Mim",
    "paragraph1": "Estudante de Análise e Desenvolvimento de Sistemas, sou um entusiasta da tecnologia com profunda paixão por programação e infraestrutura de TI. Minha jornada na área tech é impulsionada pela curiosidade constante e pelo desejo de transformar ideias em soluções digitais que façam a diferença.",
    "paragraph2": "Atualmente, atuo como estagiário em Desenvolvimento Full Stack na CGE/RO (Controladoria Geral do Estado de Rondônia), onde integro o Núcleo de Inovação e Prevenção à Corrupção. Nessa posição estratégica, tenho a oportunidade de aplicar conhecimentos técnicos em projetos que promovem transparência e modernização do setor público, contribuindo diretamente para uma gestão mais eficiente e íntegra."
  },
  "SkillsSection": {
    "title": "Tecnologias"
  },
  "ExperienceSection": {
    "title": "Experiências",
    "professional": "Profissional",
    "academic": "Acadêmica",
    "items": {
      "prof-1": {
        "title": "Estagiário de Desenvolvimento Full Stack",
        "company": "CGE/RO - Controladoria Geral do Estado de Rondônia",
        "period": "abr de 2025 - Presente",
        "description": "Desenvolvimento de sistemas web escaláveis, com foco em arquiteturas modernas, segurança e performance."
      },
      "prof-2": {
        "title": "Estagiário de TI",
        "company": "CGE/RO (Controladoria Geral do Estado de Rondônia)",
        "period": "out de 2024 - abr de 2025",
        "description": "Atuei com suporte e infraestrutura de TI, realizando manutenção de computadores, administração de redes e suporte técnico a servidores do órgão."
      },
      "acad-1": {
        "title": "CST em Análise e Desenvolvimento de Sistemas",
        "company": "IFRO (Instituto Federal de Educação, Ciência e Tecnologia de Rondônia)",
        "period": "fev de 2023 - Presente",
        "description": "Cursando o 5º de 6 períodos, integrei a equipe de desenvolvimento do campus, Calama Devs."
      },
      "acad-2": {
        "title": "Técnico em Informática",
        "company": "IFAM (Instituto Federal de Educação, Ciência e Tecnologia do Amazonas)",
        "period": "jan de 2018 - dez de 2020",
        "description": "Ensino médio com foco em desenvolvimento de sistemas e suporte. Participei de projeto de projeto de extensão e desenvolvi habilidades técnicas e trabalho em equipe."
      }
    }
  },
  "ProjectsSection": {
    "title": "Projetos",
    "items": {
      "coneci-ro": {
        "title": "CONECI - RO (Em Construção)",
        "description": "Desenvolvendo a landing page oficial do CONECI-RO, o Conselho Estadual de Controle Interno, com sistema de votação para eleger a nova presidência do evento."
      },
      "estudante-auditor": {
        "title": "Estudante Auditor (Em Construção)",
        "description": "Desenvolvendo a landing page oficial do Projeto Estudante Auditor, uma iniciativa da Controladoria-Geral do Estado de Rondônia (CGE/RO) em parceria com a SEDUC/RO."
      },
      "wiki-cge": {
        "title": "Wiki.CGE (Em construção)",
        "description": "Participo no desenvolvimento da Wiki.CGE, uma plataforma informativa voltada à transparência, documentação interna e disseminação de conhecimento institucional da Controladoria Geral do Estado de Rondônia."
      },
      "gerenciador-de-horarios": {
        "title": "Gerenciador de Horarios",
        "description": "Sistema para gerenciamento dos horários de aulas do IFRO. Fui responsável pelo desenvolvimento do backend, com foco especial na importação de planilhas utilizando a biblioteca PhpSpreadsheet"
      },
      "chaewon-yugioh": {
        "title": "3D Card Chaewon Yugioh",
        "description": "Desenvolvi uma carta 3D animada da Chaewon em estilo Yu-Gi-Oh!"
      },
      "catedog": {
        "title": "Cat&Dog",
        "description": "Sistema web para pet shop com cadastro de usuários e animais, solicitação de serviços (banho, tosa), e-commerce com entrega gratuita e painel administrativo completo."
      },
      "pokedex": {
        "title": "Pokedex",
        "description": "Desenvolvido com o objetivo de praticar o consumo de APIs. É uma Pokédex interativa que utiliza a PokéAPI para buscar informações em tempo real sobre diferentes Pokémons, como nome, imagem, tipo e número."
      },
      "receitas-do-mestre": {
        "title": "Receitas do Mestre",
        "description": "É um blog de receitas, que foi realizado como parte da disciplina Fundamentos de Programação Web, com o intuito de demonstrar conhecimentos em HTML."
      },
      "spacetime-sga": {
        "title": "Spacetime - Shai Gilgeous Alexander",
        "description": "Uma cápsula do tempo interativa para exibir memórias ao longo de uma linha do tempo, criando uma experiência visual e responsiva."
      }
    }
  },
  "ContactSection": {
    "title": "Contato",
    "getInTouch": "Entre em Contato",
    "description": "Estou sempre aberto a novas oportunidades e colaborações. Entre em contato comigo!",
    "email": "Email",
    "location": "Localização",
    "followMe": "Me Siga",
    "sendMessage": "Enviar Mensagem",
    "form": {
      "name": "Nome",
      "namePlaceholder": "Seu nome completo",
      "email": "Email",
      "emailPlaceholder": "seu.email@exemplo.com",
      "subject": "Assunto",
      "subjectPlaceholder": "Sobre o que você gostaria de falar?",
      "message": "Mensagem",
      "messagePlaceholder": "Escreva sua mensagem aqui...",
      "submit": "Enviar Mensagem",
      "sending": "Enviando...",
      "success": "Enviado com sucesso!",
      "tryAgain": "Tentar novamente",
      "successMessage": "Mensagem enviada com sucesso! Responderei em breve.",
      "errorDefault": "Erro ao enviar mensagem",
      "errorUnknown": "Erro desconhecido"
    }
  }
}